---
kind: enumMember
id: F:Autodesk.Revit.DB.FillPatternHostOrientation.ToHost
enum: Autodesk.Revit.DB.FillPatternHostOrientation
source: html/77580679-4563-f4f8-0253-af7215d4dea6.htm
---
# Autodesk.Revit.DB.FillPatternHostOrientation.ToHost

Patterns align with the host and compute a origin to fit the host.